[{"title": "1. Poor Things", "year": "2023", "rating": "8.1 (179K)", "summary": "The incredible tale about the fantastical evolution of Bella Baxter, a young woman brought back to life by the brilliant and unorthodox scientist Dr. Godwin Baxter."}, {"title": "2. Avatar: The Last Airbender", "year": "2024- ", "rating": "7.3 (56K)", "summary": "A young boy known as the Avatar must master the four elemental powers to save the world, and fight against an enemy bent on stopping him."}, {"title": "3. The Gentlemen", "year": "2024", "rating": "8.3 (28K)", "summary": "When aristocratic Eddie inherits the family estate, he discovers that it's home to a huge weed empire, and its proprietors aren't going anywhere."}, {"title": "4. Resident Alien", "year": "2021- ", "rating": "8.1 (54K)", "summary": "A crash-landed alien takes on the identity of a small-town Colorado doctor and slowly begins to wrestle with the moral dilemma of his secret mission on Earth."}, {"title": "5. One Day", "year": "2024", "rating": "8.2 (33K)", "summary": "Emma and Dexter meet for the first time on the night of their graduation. Tomorrow they must go their separate ways."}, {"title": "6. Kung Fu Panda 4", "year": "2024", "rating": "6.6 (7.5K)", "summary": "After Po is tapped to become the Spiritual Leader of the Valley of Peace, he needs to find and train a new Dragon Warrior, while a wicked sorceress plans to re-summon all the master villains whom Po has vanquished to the spirit realm."}, {"title": "7. Anyone But You", "year": "2023", "rating": "6.2 (51K)", "summary": "After an amazing first date, Bea and Ben's fiery attraction turns ice-cold--until they find themselves unexpectedly reunited at a wedding in Australia. So they do what any two mature adults would do: pretend to be a couple."}, {"title": "8. Ricky Stanicky", "year": "2024", "rating": "6.2 (17K)", "summary": "When three childhood best friends pull a prank that goes wrong, they invent the imaginary Ricky Stanicky to get them out of trouble. Twenty years later, they still use the nonexistent Ricky as a handy alibi for their immature behavior."}, {"title": "9. The Holdovers", "year": "2023", "rating": "8.0 (122K)", "summary": "A cranky history teacher at a prep school is forced to remain on campus over the holidays with a grieving cook and a troubled student who has no place to go."}, {"title": "10. Wonka", "year": "2023", "rating": "7.1 (117K)", "summary": "With dreams of opening a shop in a city renowned for its chocolate, a young and poor Willy Wonka discovers that the industry is run by a cartel of greedy chocolatiers."}, {"title": "11. American Fiction", "year": "2023", "rating": "7.6 (54K)", "summary": "A novelist who's fed up with the establishment profiting from Black entertainment uses a pen name to write a book that propels him into the heart of the hypocrisy and madness he claims to disdain."}, {"title": "12. Curb Your Enthusiasm", "year": "2000-2024", "rating": "8.8 (144K)", "summary": "Larry David stars as an over-the-top version of himself in this comedy series that shows how seemingly trivial details of day-to-day life can precipitate a catastrophic chain of events."}, {"title": "13. Young Sheldon", "year": "2017-2024", "rating": "7.6 (98K)", "summary": "Meet a child genius named Sheldon Cooper (already seen as an adult in The Big Bang Theory (2007)) and his family. Some unique challenges face Sheldon, who is socially impaired."}, {"title": "14. Mean Girls", "year": "2024", "rating": "5.8 (22K)", "summary": "Cady Heron is a hit with the Plastics, an A-list girl clique at her new school. But everything changes when she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George."}, {"title": "15. Saltburn", "year": "2023", "rating": "7.0 (191K)", "summary": "A student at Oxford University finds himself drawn into the world of a charming and aristocratic classmate, who invites him to his eccentric family's sprawling estate for a summer never to be forgotten."}, {"title": "16. The Bear", "year": "2022- ", "rating": "8.6 (204K)", "summary": "A young chef from the fine dining world returns to Chicago to run his family's sandwich shop."}, {"title": "17. Suits", "year": "2011-2019", "rating": "8.4 (474K)", "summary": "On the run from a drug deal gone bad, brilliant college dropout Mike Ross finds himself working with Harvey Specter, one of New York City's best lawyers."}, {"title": "18. The White Lotus", "year": "2021-2025", "rating": "8.0 (203K)", "summary": "The exploits of various guests and employees of a luxury resort over the span of a week."}, {"title": "19. Megamind vs. The Doom Syndicate", "year": "2024", "rating": "2.3 (2.5K)", "summary": "Megamind's former villain team, The Doom Syndicate, has returned. Our newly crowned blue hero must now keep up evil appearances until he can assemble his friends to stop his former evil teammates from launching Metro City to the Moon."}, {"title": "20. The Boys", "year": "2019- ", "rating": "8.7 (640K)", "summary": "A group of vigilantes set out to take down corrupt superheroes who abuse their superpowers."}, {"title": "21. Mr. & Mrs. Smith", "year": "2024- ", "rating": "7.0 (33K)", "summary": "Two strangers land jobs with a spy agency that offers them a life of espionage, wealth, and travel. The catch: new identities in an arranged marriage."}, {"title": "22. The Completely Made-Up Adventures of Dick Turpin", "year": "2024- ", "rating": "7.0 (1.7K)", "summary": "A reluctant leader of a gang of rogues sets out on a series of wild adventures, all while trying to outwit the corrupt lawman and \"thief-taker\" Jonathan Wilde."}, {"title": "23. Shameless", "year": "2011-2021", "rating": "8.5 (281K)", "summary": "A scrappy, feisty, fiercely loyal Chicago family makes no apologies."}, {"title": "24. Inside Out 2", "year": "2024", "summary": "Follow Riley, in her teenage years, encountering new emotions."}, {"title": "25. The Office", "year": "2005-2013", "rating": "9.0 (703K)", "summary": "A mockumentary on a group of typical office workers, where the workday consists of ego clashes, inappropriate behavior, and tedium."}, {"title": "26. Ghostbusters: Frozen Empire", "year": "2024", "summary": "When the discovery of an ancient artifact unleashes an evil force, Ghostbusters new and old must join forces to protect their home and save the world from a second ice age."}, {"title": "27. Brooklyn Nine-Nine", "year": "2013-2021", "rating": "8.4 (358K)", "summary": "Comedy series following the exploits of Det. Jake Peralta and his diverse, lovable colleagues as they police the NYPD's 99th Precinct."}, {"title": "28. Death in Paradise", "year": "2011- ", "rating": "7.8 (27K)", "summary": "A Detective Inspector is transferred from London to the Caribbean island of Saint-Marie to investigate and solve complex murders."}, {"title": "29. Barbie", "year": "2023", "rating": "6.9 (515K)", "summary": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans."}, {"title": "30. Succession", "year": "2018-2023", "rating": "8.8 (267K)", "summary": "The Roy family is known for controlling the biggest media and entertainment company in the world. However, their world changes when their father steps down from the company."}, {"title": "31. Hazbin Hotel", "year": "2019- ", "rating": "7.8 (20K)", "summary": "In an attempt to find a non-violent alternative for reducing Hell's overpopulation, the daughter of Lucifer opens a rehabilitation hotel that offers a group of misfit demons a chance at redemption."}, {"title": "32. The Big Bang Theory", "year": "2007-2019", "rating": "8.1 (863K)", "summary": "A woman who moves into an apartment across the hall from two brilliant but socially awkward physicists shows them how little they know about life outside of the laboratory."}, {"title": "33. The Thundermans Return", "year": "2024", "rating": "5.2 (801)", "summary": "It centers on the family as they begin a new era of superhero crimefighting. When one save goes wrong, the Thundermans are sent back to Hiddenville."}, {"title": "34. Maamla Legal Hai", "year": "2024- ", "rating": "8.2 (3.9K)", "summary": "Chaos collides with the letter of the law at District Court Patparganj, where quirky employees work to uphold justice but not without a few objections."}, {"title": "35. Lisa Frankenstein", "year": "2024", "rating": "6.1 (9.3K)", "summary": "A coming of RAGE love story about a teenager and her crush, who happens to be a corpse. After a set of horrific circumstances bring him back to life, the two embark on a journey to find love, happiness - and a few missing body parts."}, {"title": "36. Miller's Girl", "year": "2024", "rating": "5.2 (6.5K)", "summary": "A creative writing assignment yields complex results between a teacher and his talented student."}, {"title": "37. Modern Family", "year": "2009-2020", "rating": "8.5 (479K)", "summary": "Three different, but related, families face trials and tribulations in their own uniquely comedic ways."}, {"title": "38. Friends", "year": "1994-2004", "rating": "8.9 (1.1M)", "summary": "Follows the personal and professional lives of six twenty to thirty year-old friends living in the Manhattan borough of New York City."}, {"title": "39. Ted Lasso", "year": "2020-2023", "rating": "8.8 (342K)", "summary": "American college football coach Ted Lasso heads to London to manage AFC Richmond, a struggling English Premier League soccer team."}, {"title": "40. Deadpool & Wolverine", "year": "2024", "summary": "Wolverine is recovering from his injuries when he crosses paths with the loudmouth, Deadpool. They team up to defeat a common enemy."}, {"title": "41. Upgraded", "year": "2024", "rating": "6.1 (16K)", "summary": "When Ana is upgraded to first class on a work trip, she meets handsome Will, who mistakes Ana for her boss, Claire. A white lie then sets off a glamorous chain of events, romance and opportunity, until her fib threatens to surface."}, {"title": "42. Drive-Away Dolls", "year": "2024", "rating": "5.7 (6.9K)", "summary": "Jamie regrets her breakup with her girlfriend, while Marian needs to relax. In search of a fresh start, they embark on an unexpected road trip to Tallahassee. Things quickly go awry when they cross paths with a group of inept criminals."}, {"title": "43. Once Upon a Time... in Hollywood", "year": "2019", "rating": "7.6 (839K)", "summary": "A faded television actor and his stunt double strive to achieve fame and success in the final years of Hollywood's Golden Age in 1969 Los Angeles."}, {"title": "44. Ghosts", "year": "2021- ", "rating": "7.9 (28K)", "summary": "A young couple, Sam and Jay, inherit a haunted mansion and, unaware of their invisible housemates, plan to turn it into a B&B. Their lives become much more complicated after a fall causes Sam to see the ghosts. Based on the UK series."}, {"title": "45. Borderlands", "year": "2024", "summary": "The popular video game set on the abandoned fictional planet of Pandora where people search for a mysterious relic."}, {"title": "46. One Piece", "year": "1999- ", "rating": "9.0 (228K)", "summary": "Monkey D. Luffy sets off on an adventure with his pirate crew in hopes of finding the greatest treasure ever, known as the \"One Piece.\""}, {"title": "47. Extraordinary", "year": "2023- ", "rating": "7.7 (15K)", "summary": "Jen is a self-aware young woman who lives in a world where everybody except her has a superpower."}, {"title": "48. Loudermilk", "year": "2017-2020", "rating": "7.9 (17K)", "summary": "Sam Loudermilk is a recovering alcoholic and substance-abuse counselor with a bad attitude. Although he has his drinking under control, Loudermilk discovers that when your life is a mess, getting clean is the easy part."}, {"title": "49. It's Always Sunny in Philadelphia", "year": "2005- ", "rating": "8.8 (250K)", "summary": "Five friends with big egos and small brains are the proprietors of an Irish pub in Philadelphia."}, {"title": "50. Ted", "year": "2024", "rating": "8.0 (24K)", "summary": "It's 1993, and Ted the bear's moment of fame has passed. He's living back home with his best friend, John Bennett, and his family. While Ted may be a lousy influence on John, he's a loyal pal who will go out on a limb for friendship."}]